_org/_posts/2014-12-15-sqldeveloper.org
#+BEGIN_HTML
---
layout: view_simple
title: 解决linux下sqldeveloper 中文环境显示乱码的问题
excerpt: 
keywords: ""
categories: [Linux]
tags: [linux,sqldeveloper]
---

#+END_HTML

在linux环境下装sql developer,选择中文的字体时出现乱码。由于SQL Developer使用了JDK，java环境当中缺少中文字体造成了乱码，我安装的是JDK1.6u21，因此我的JAVA的PATH是 /usr/lib/jvm/java/jdk1.6.0_21/jre/lib/fonts/ ，进入之后创建一个目录

#+begin_src shell
mkdir fallback
cd fallback
#+end_src

然后在fallback目录下 使用ln创建符号链接文件，告诉SQL Developer中文字体的路径。我这里用的consolas+微软雅黑。

#+begin_src shell
ln -s /usr/share/fonts/win7/Yahei.Consolas.1.11b.ttf YaHei.Consolas.1.11b.ttf
mkfontdir
mkfontscale
#+end_src

然后再打开SQL Developer 就可以选择中文字体了。
