achieved/2015-08-28-sqldeveloper.html
---
layout: view
comments: true
title: 解决linux下sqldeveloper 中文环境显示乱码的问题
categories: linux&unix
tags: [linux,sqldeveloper,font]
date: 2014-4-4
keywords: linux,sqldeveloper,font
description: 解决linux下sqldeveloper 中文环境显示乱码的问题
---

<p>
解决linux下sqldeveloper 中文环境显示乱码的问题
</p>

<!-- more -->

<p>
在linux环境下装sql developer,选择中文的字体时出现乱码。由于SQL Developer使用了JDK，java环境当中缺少中文字体造成了乱码，我安装的是JDK1.6u21，因此我的JAVA的PATH是 <i>usr/lib/jvm/java/jdk1.6.0_21/jre/lib/fonts</i> ，进入之后创建一个目录
</p>

<div class="org-src-container">

<pre class="src src-shell">mkdir fallback
cd fallback
</pre>
</div>

<p>
然后在fallback目录下 使用ln创建符号链接文件，告诉SQL Developer中文字体的路径。我这里用的consolas+微软雅黑。
</p>

<div class="org-src-container">

<pre class="src src-shell">ln -s /usr/share/fonts/win7/Yahei.Consolas.1.11b.ttf YaHei.Consolas.1.11b.ttf
mkfontdir
mkfontscale
</pre>
</div>

<p>
然后再打开SQL Developer 就可以选择中文字体了。
</p>
